# Taps
tap "AdoptOpenJDK/openjdk"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Casks
cask "adoptopenjdk8"
cask "adoptopenjdk"
cask "appcleaner"
cask "calibre" # ebook reader/generator
cask "cheatsheet" # Cheatsheets for apps
cask "docker-toolbox"
cask "dozer" # status bar organizer
cask "dropbox"
cask "eclipse-java"
cask "font-source-code-pro-for-powerline"
cask "firefox"
cask "google-chrome"
cask "iina" # video player for multiple formats - like vnc
cask "iterm2" # better terminal
cask "jdownloader" # download management tool
cask "latest" # software update checker
cask "microsoft-edge"
cask "onyx" # mac cleaner
cask "openinterminal-lite" # button added to finder to launch in terminal
cask "rectangle" # window orgainzer
cask "scrivener" # writing tool
cask "skype"
cask "the-unarchiver"
cask "virtualbox"
cask "virtualbox-extension-pack"
#cask "visual-studio-code"
#cask "vlc"
cask "vnc-viewer"
cask "vscodium" # vscode without all the Microsoft stuff
cask "zoomus" # video conferencing

# Brews
brew "aria2" # download utility - like wget, but better 
brew "bash" # newer version of bash than the defaut bash installed with mac
brew "brew-cask-completion"
brew "coreutils"
#brew "curl"
brew "git"
brew "htop"
brew "jq" # command-line JSON processor
brew "mas" # mac apple store command-line
brew "maven"
brew "speedtest-cli"
brew "tree"
#brew "wget"
brew "zsh-completions"
brew "zsh-autosuggestions"

# mas
mas "Amphetamine", id: 937984704
mas "Battery Health 2", id: 1120214373
mas "Copy Me That", id: 1475975349
mas "Highland 2", id: 1171820258
mas "Keynote", id: 409183694
mas "Memory Clean 2", id: 1114591412
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
