# Taps
tap "AdoptOpenJDK/openjdk"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Casks
cask "adoptopenjdk8"
cask "adoptopenjdk"
cask "appcleaner"
cask "calibre"
cask "docker-toolbox"
cask "dozer"
cask "eclipse-java"
cask "font-source-code-pro-for-powerline"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "microsoft-edge"
cask "onyx"
cask "openinterminal-lite"
cask "scrivener"
cask "skype"
cask "the-unarchiver"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"

# Brews
brew "bash"
brew "brew-cask-completion"
brew "coreutils"
brew "curl"
cask "dozer"
cask "dropbox"
brew "git"
brew "htop"
brew "jq"
brew "mas"
brew "maven"
brew "speedtest-cli"
brew "tree"
brew "wget"
brew "zsh-completions"

# mas
mas "Amphetamine", id: 937984704
mas "Battery Health 2", id: 1120214373
mas "Copy Me That", id: 1475975349
mas "Highland 2", id: 1171820258
mas "Keynote", id: 409183694
mas "Memory Clean 2", id: 1114591412
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
